{
	"actions": [
		{
			"desc": "The blood hag makes two claw attacks and one blood-drinking hair attack.",
			"name": "Multiattack"
		},
		{
			"attack_bonus": 9,
			"damage_dice": "3d8",
			"desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 18 (3d8 + 5) piercing damage and a Medium or smaller target is grappled (escape DC 15). A grappled creature takes 13 (2d8 + 3) necrotic damage at the start of the hag's turns, and the hag heals half as many hit points. The hag gains excess healing as temporary hit points. The hag can grapple one or two creatures at a time. Also see Face Peel.",
			"name": "Blood-Drinking Hair"
		},
		{
			"attack_bonus": 9,
			"damage_dice": "4d6",
			"desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 19 (4d6 + 5) slashing damage.",
			"name": "Claws"
		},
		{
			"desc": "The blood hag targets a living creature within 30 feet that she detects with her blood sense and makes the target bleed uncontrollably. The target must make a successful DC 16 Constitution saving throw or suffer one of the effects listed below. A target that saves successfully cannot be affected by this hag's ability again for 24 hours.",
			"name": "Call the Blood"
		},
		{
			"desc": "Blood Choke Curse. The target's mouth fills with blood, preventing any speech or spellcasting with verbal components for 1 minute.",
			"name": "1"
		},
		{
			"desc": "Blood Eye. The target's eyes well up with bloody tears. The target is blinded for 1 minute.",
			"name": "2"
		},
		{
			"desc": "Heart Like Thunder. The target hears only the rushing of blood and their thumping heart. They are deaf for 1 minute.",
			"name": "3"
		},
		{
			"desc": "Rupturing Arteries. The victim suffers 7 (2d6) slashing damage as its veins and arteries burst open. The target repeats the saving throw at the beginning of each of its turns. It takes 3 (1d6) necrotic damage if the saving throw fails, but the effect ends on a successful save.",
			"name": "4"
		},
		{
			"desc": "The blood hag peels the face off one grappled foe. The target must make a DC 17 Dexterity saving throw. If the saving throw fails, the face is torn off; the target takes 38 (8d6 + 10) slashing damage and is stunned until the start of the hag's next turn. If the save succeeds, the target takes half damage and isn't stunned. Heal, regeneration, or comparable magic restores the stolen features; other curative magic forms a mass of scar tissue. The peeled-off face is a tiny, animated object (per the spell-20 HP, AC 18, no attack, Str 4, Dex 18) under the hag's control. It retains the former owner's memories and personality. Blood hags keep such faces as trophies, but they can also wear someone's face to gain advantage on Charisma (Deception) checks made to imitate the face's former owner.",
			"name": "Face Peel"
		}
	],
	"alignment": "lawful good",
	"armor_class": 14,
	"armor_desc": "natural armor",
	"challenge_rating": "5",
	"charisma": 18,
	"charisma_save": 7,
	"condition_immunities": "charmed, frightened",
	"constitution": 14,
	"constitution_save": null,
	"damage_immunities": "",
	"damage_resistances": "",
	"damage_vulnerabilities": "",
	"dexterity": 10,
	"dexterity_save": null,
	"document__license_url": "http://open5e.com/legal",
	"document__slug": "cc",
	"document__title": "Creature Codex OGL",
	"group": null,
	"hit_dice": "10d10+50",
	"hit_points": 104,
	"img_main": null,
	"intelligence": 10,
	"intelligence_save": null,
	"languages": "understands all but can't speak",
	"legendary_actions": [
		{
			"desc": "The mummy lord makes one attack with its rotting fist or uses its Dreadful Glare.",
			"name": "Attack"
		},
		{
			"desc": "Blinding dust and sand swirls magically around the mummy lord. Each creature within 5 feet of the mummy lord must succeed on a DC 16 Constitution saving throw or be blinded until the end of the creature's next turn.",
			"name": "Blinding Dust"
		},
		{
			"desc": "The mummy lord utters a blasphemous word. Each non-undead creature within 10 feet of the mummy lord that can hear the magical utterance must succeed on a DC 16 Constitution saving throw or be stunned until the end of the mummy lord's next turn.",
			"name": "Blasphemous Word (Costs 2 Actions)"
		},
		{
			"desc": "The mummy lord magically unleashes negative energy. Creatures within 60 feet of the mummy lord, including ones behind barriers and around corners, can't regain hit points until the end of the mummy lord's next turn.",
			"name": "Channel Negative Energy (Costs 2 Actions)"
		},
		{
			"desc": "The mummy lord magically transforms into a whirlwind of sand, moves up to 60 feet, and reverts to its normal form. While in whirlwind form, the mummy lord is immune to all damage, and it can't be grappled, petrified, knocked prone, restrained, or stunned. Equipment worn or carried by the mummy lord remain in its possession.",
			"name": "Whirlwind of Sand (Costs 2 Actions)"
		}
	],
	"legendary_desc": "The aatxe can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The aatxe regains spent legendary actions at the start of its turn.",
	"name": "Aatxe",
	"perception": 7,
	"reactions": [
		{
			"desc": "The bandit lord adds 2 to its AC against one melee attack that would hit it. To do so the bandit lord must see the attacker and be wielding a weapon.",
			"name": "Parry"
		},
		{
			"desc": "When a creature the bandit lord can see targets it with an attack, the bandit lord chooses an ally within 5 feet of it. The bandit lord and the ally swap places, and the chosen ally becomes the target instead.",
			"name": "Redirect Attack"
		}
	],
	"senses": "passive Perception 12",
	"size": "Large",
	"skills": {
		"acrobatics": 6,
		"arcana": 10,
		"athletics": 6,
		"deception": 5,
		"history": 10,
		"insight": 7,
		"intimidation": 1,
		"investigation": 8,
		"medicine": 6,
		"nature": 2,
		"perception": 7,
		"performance": 11,
		"persuasion": 8,
		"religion": 3,
		"stealth": 5,
		"survival": 4
	},
	"slug": "aatxe",
	"special_abilities": [
		{
			"desc": "Hunduns are immune to any spell or effect that allows an Intelligence, Wisdom, or Charisma saving throw. Trying to contact or read a Hundun's mind confuses the caster as the spell for 1 round.",
			"name": "Brainless"
		},
		{
			"desc": "Hunduns can perform an act of magical creation almost unlimited in scope every 1d8 days. The effect is equivalent to a wish spell, but it must create something.",
			"name": "Dance of Creation"
		},
		{
			"desc": "when a hundun's confusion spell affects a target, it can elect to use the following table rather than the standard one:\n\n1d100 Result",
			"name": "Enlightening Befuddlement"
		},
		{
			"desc": "Advantage on attack rolls, ability checks, and saving throws",
			"name": "01-10 Inspired:"
		},
		{
			"desc": "Disadvantage on attack rolls, ability checks, and saving throws",
			"name": "11-20 Distracted:"
		},
		{
			"desc": "The target does nothing but babble or scribble incoherent notes on a new idea",
			"name": "21-50 Incoherent:"
		},
		{
			"desc": "Target is recipient of geas to create a quality magical object",
			"name": "51-75 Obsessed:"
		},
		{
			"desc": "Target receives a suggestion from the hundun",
			"name": "76-100 Suggestible:"
		},
		{
			"desc": "the hundun's innate spellcasting ability is Wisdom (spell save DC 17). It can cast the following spells, requiring no material components:\n\nconstant: confusion (always centered on the hundun), detect thoughts\n\nat will: create or destroy water, dancing lights, mending, prestidigitation\n\n3/day each: compulsion, dimension door, black tentacles, irresistible dance\n\n1/day each: awaken, creation, heroes' feast, magnificent mansion, plant growth, reincarnate, stone shape",
			"name": "Innate Spellcasting"
		},
		{
			"desc": "The hundun's weapon attacks are magical.",
			"name": "Magic Weapons"
		}
	],
	"speed": {
		"burrow": 20,
		"climb": 30,
		"fly": 40,
		"hover": true,
		"lightwalking": 80,
		"notes": "40 ft., climb 30 ft. in bear or hybrid form",
		"swim": 20,
		"walk": 30
	},
	"spell_list": [
		"https://api.open5e.com/spells/mage-hand/",
		"https://api.open5e.com/spells/prestidigitation/",
		"https://api.open5e.com/spells/ray-of-frost/",
		"https://api.open5e.com/spells/detect-magic/",
		"https://api.open5e.com/spells/magic-missile/",
		"https://api.open5e.com/spells/shield/",
		"https://api.open5e.com/spells/thunderwave/",
		"https://api.open5e.com/spells/detect-thoughts/",
		"https://api.open5e.com/spells/invisibility/",
		"https://api.open5e.com/spells/acid-arrow/",
		"https://api.open5e.com/spells/mirror-image/",
		"https://api.open5e.com/spells/animate-dead/",
		"https://api.open5e.com/spells/counterspell/",
		"https://api.open5e.com/spells/dispel-magic/",
		"https://api.open5e.com/spells/fireball/",
		"https://api.open5e.com/spells/blight/",
		"https://api.open5e.com/spells/dimension-door/",
		"https://api.open5e.com/spells/cloudkill/",
		"https://api.open5e.com/spells/scrying/",
		"https://api.open5e.com/spells/disintegrate/",
		"https://api.open5e.com/spells/globe-of-invulnerability/",
		"https://api.open5e.com/spells/finger-of-death/",
		"https://api.open5e.com/spells/plane-shift/",
		"https://api.open5e.com/spells/dominate-monster/",
		"https://api.open5e.com/spells/power-word-stun/",
		"https://api.open5e.com/spells/power-word-kill/"
	],
	"strength": 16,
	"strength_save": null,
	"subtype": "shapechanger",
	"type": "celestial",
	"wisdom": 18,
	"wisdom_save": null
}
